In [40]:
import pandas as pd 
import numpy as np

## Pandas Series

In [41]:
first_name = pd.Series(["jane", "john", "jasmine", "teddy", "megan", "jeffrey", "edward", "jaime"])
first_name

0       jane
1       john
2    jasmine
3      teddy
4      megan
5    jeffrey
6     edward
7      jaime
dtype: object

In [42]:
last_name = pd.Series(["olsen", "Totti", "kennedy", "roosevelt", "fox", "bridges", "scissorhand", "cox"])
last_name

0          olsen
1          Totti
2        kennedy
3      roosevelt
4            fox
5        bridges
6    scissorhand
7            cox
dtype: object

In [43]:
age = pd.Series([34, 28, 13, 45, 51, 36, 18, 65])
age

0    34
1    28
2    13
3    45
4    51
5    36
6    18
7    65
dtype: int64

## DataFrame named customer using the above list of Pandas Series

In [44]:
customer = pd.DataFrame({"first_name": first_name,"last_name":last_name, "age":age})
customer

  first_name    last_name  age
0       jane        olsen   34
1       john        Totti   28
2    jasmine      kennedy   13
3      teddy    roosevelt   45
4      megan          fox   51
5    jeffrey      bridges   36
6     edward  scissorhand   18
7      jaime          cox   65

## Using masking, select list of customers who are between 20 and 35 in age

In [45]:
customer[(age > 20) & (age < 35)]

  first_name last_name  age
0       jane     olsen   34
1       john     Totti   28

## Using slicing, select every other row.

Other rows after masking

In [46]:
customer.loc[2:8]

  first_name    last_name  age
2    jasmine      kennedy   13
3      teddy    roosevelt   45
4      megan          fox   51
5    jeffrey      bridges   36
6     edward  scissorhand   18
7      jaime          cox   65

Alternate rows

In [47]:
customer.loc[::2]

  first_name    last_name  age
0       jane        olsen   34
2    jasmine      kennedy   13
4      megan          fox   51
6     edward  scissorhand   18

## Using fancy indexing, create a new DataFrame with only "last_name" and "age" columns

In [48]:
df1= customer[["last_name","age"]]
df1

     last_name  age
0        olsen   34
1        Totti   28
2      kennedy   13
3    roosevelt   45
4          fox   51
5      bridges   36
6  scissorhand   18
7          cox   65

## Using implicit indexing attribute and slicing, create a new DataFrame with indices between 2 and 5.

Indices between 2 and 5 mean, to display indices 3 and 4 (As it is implicit indexing, 5 is not included)

In [49]:
df2=customer[3:5]
df2

  first_name  last_name  age
3      teddy  roosevelt   45
4      megan        fox   51

Inidices from 2 to 4 ((As it is implicit indexing, 5 is not included)

In [50]:
df3=customer[2:5]
df3

  first_name  last_name  age
2    jasmine    kennedy   13
3      teddy  roosevelt   45
4      megan        fox   51

## New DataFrame named customer_amount_nan  by adding another Pandas Series

In [51]:
total_sales =  pd.Series([32.10, 50.80, 13.00, 98.21, np.NAN, 0.50, None, 77.01])
total_sales

0    32.10
1    50.80
2    13.00
3    98.21
4      NaN
5     0.50
6      NaN
7    77.01
dtype: float64

In [52]:
customer_amount_nan =  customer.copy()

In [53]:
customer_amount_nan ['total_sales'] = total_sales
customer_amount_nan

  first_name    last_name  age  total_sales
0       jane        olsen   34        32.10
1       john        Totti   28        50.80
2    jasmine      kennedy   13        13.00
3      teddy    roosevelt   45        98.21
4      megan          fox   51          NaN
5    jeffrey      bridges   36         0.50
6     edward  scissorhand   18          NaN
7      jaime          cox   65        77.01

## Using forward fill to fill the missing values

In [54]:
customer_amount_nan.ffill()

  first_name    last_name  age  total_sales
0       jane        olsen   34        32.10
1       john        Totti   28        50.80
2    jasmine      kennedy   13        13.00
3      teddy    roosevelt   45        98.21
4      megan          fox   51        98.21
5    jeffrey      bridges   36         0.50
6     edward  scissorhand   18         0.50
7      jaime          cox   65        77.01

## Using backward fill to fill the missing values

In [55]:
customer_amount_nan.bfill()

  first_name    last_name  age  total_sales
0       jane        olsen   34        32.10
1       john        Totti   28        50.80
2    jasmine      kennedy   13        13.00
3      teddy    roosevelt   45        98.21
4      megan          fox   51         0.50
5    jeffrey      bridges   36         0.50
6     edward  scissorhand   18        77.01
7      jaime          cox   65        77.01

## Filling the missing values with value of 0.00

In [56]:
customer_amount_nan.fillna(0)

  first_name    last_name  age  total_sales
0       jane        olsen   34        32.10
1       john        Totti   28        50.80
2    jasmine      kennedy   13        13.00
3      teddy    roosevelt   45        98.21
4      megan          fox   51         0.00
5    jeffrey      bridges   36         0.50
6     edward  scissorhand   18         0.00
7      jaime          cox   65        77.01